extends Node

#var: variable: عامل
# # أعلن عن المتغيرات الأعضاء هنا. الأمثلة:
var تعيين_القيمة

#func: function: وظيفة
# يتم استدعاؤها عندما تدخل العقدة إلى شجرة المشهد لأول مرة.
func _ready():
	
	#مشغلات التعيين
	تعيين_القيمة = 10 # =هو عامل التعيين = 
	تعيين_القيمة = 10 + 10 # هو عامل الإضافي +
	تعيين_القيمة = 10 - 10 #  هو عامل الطرح - 
	تعيين_القيمة = 10 * 10 #  هو عامل الضرب * 
	تعيين_القيمة = 10 % 9 # هو عامل الباقي % 
	تعيين_القيمة = 10 / 9 # هو عامل الباقي % 
	
	# مشغلات المقارنة
	تعيين_القيمة > 10 # عامل أكبر من
	تعيين_القيمة >= 10 #أكبر من أو يساوي
	تعيين_القيمة < 10 # أقل من
	تعيين_القيمة <= 10 # أقل من أو يساوي
	تعيين_القيمة == 10 # يساوي
	تعيين_القيمة != 10 # لا يساوي
	
	# المعاملات المنطقية
	تعيين_القيمة || true # أو المشغل
	تعيين_القيمة or true#المشغل او
	تعيين_القيمة && false #و المشغل
	تعيين_القيمة and false # و المشغل
	!تعيين_القيمة #ليس مشغل
	not تعيين_القيمة # ليس مشغل
	
	pass #استبدال بجسم الوظيفة.
#pass: يمر

# يتم استدعاء كل إطار. 'دلتا' هو الوقت المنقضي منذ الإطار السابق.
#_process: عملية
#func _process(delta):
#	pass
#pass: يمر
