extends Node

#extends = يمتد
#Node =  العقدة
#var = variable = عامل
##########
##  السلسلة  
##########

#    إعلان قيمة السلسلة باستخدام علامتي الاقتباس المزدوجتين 
var خيط = "مرحبا بالعالم";

#يمكنك استخدام الأرقام والحروف داخل علامة الاقتباس المزدوجة 
var رقم_السلسلة  = "لدي 0 قطط"

#يمكنك أيضًا استخدام رموز مثل #،$،@، وما إلى ذلك. 
var رموز_السلسلة = "@#$%!"

# إذا كان متغير السلسلة الخاص بك يحتاج إلى استخدام علامات اقتباس مزدوجة ، 
#فاستخدم الشرطة المائلة للخلف متبوعة برمز علامة الاقتباس المزدوجة " " 
var استخدم_علامتي_الاقتباس_المزدوجتين = " \"هذا اقتباس مزدوج\" "

# إذا كنت بحاجة إلى إنشاء سطر جديد، استخدم 'n\' في السلسلة
var سلسلة_سطر_جديدة = "السطر_الأول" + "\n" + "  السطر الثاني"

# يمكنك أيضًا إنشاء أسطر متعددة باستخدام علامات اقتباس ثلاثية (مزدوجة) '"'"' 
var سلسلة_متعددة_الأسطر = """
هذا_متعدد_الاسطر 
لا_حاجه_لاستخدام
'\n'
لانشاء_سطر_جديد 
"""

#يمكنك أيضًا استخدام علامات الاقتباس الثلاثية (المزدوجة) لكتابة تعليقات متعددة الأسطر
#ضع في اعتبارك أن التعليقات متعددة الأسطر يتم تقديمها كسلسلة بواسطة المترجم
"""
هذا_تعليق_متعد_السطور
هذا_تعليق_متعد_السطور
"""

############
## الأعداد الصحيحة 
############

#إعلان عدد صحيح باستخدام أعداد صحيحة، تأكد من عدم استخدام الفواصل العشرية 
var عدد_صحيح = 100; 

##########
## عوامات 
##########

# أعلن عن عدد عشري، تأكد من استخدام النقطة العشرية
var القيمة_العائمة = 10.99;

##########
## منطقي 
##########

#أعلن عن قيمة منطقية عن طريق كتابة حقيقي أو خطأ شنيع
var  منطقي_صحيح = true; 
var قيمة_منطقية_خاطئة = false;

########
## فارغة 
########

# أعلن عن نوع القيمة الفارغة عن طريق كتابة "null"
var قيمة_فارغة = null;



# يتم استدعاؤها عندما تدخل العقدة إلى شجرة المشهد لأول مرة.
func _ready():
	
	pass # استبدال بجسم الوظيفة.
