extends Node

var مصفوفة_فارغة = []
var مجموعة_بسيطة = [1,2,3,4,5]

# يتم استدعاؤها عندما تدخل العقدة إلى شجرة المشهد لأول مرة.
func _ready():
	
	# المصفوفات الفرعية
	var مجموعة_فرعية = [[1,2],[3,4]]
	print('مجموعة فرعية: ', مجموعة_فرعية[1][0])
	
	# إضافة عناصر إلى الجزء الأمامي أو الخلفي من المصفوفة
	مجموعة_بسيطة.push_front(0) # [0,1,2,3,4,5]
	مجموعة_بسيطة.push_back(6) # [0,1,2,3,4,5,6]
	print('مجموعة_بسيطة بعد الدفع: ', مجموعة_بسيطة) # [0,1,2,3,4,5,6]
	
	# إخراج العناصر من الجزء الأمامي أو الخلفي للمصفوفة
	var أمام = مجموعة_بسيطة.pop_front() # مجموعة_بسيطة = [1,2,3,4,5,6], أمام = 0
	var خلف = مجموعة_بسيطة.pop_back() #مجموعة_بسيطة = [1,2,3,4,5], خلف = 6
	
	print('مجموعة_بسيطة بعد البوب: ', مجموعة_بسيطة)
	print('أمام: ', أمام)
	print('خلف: ', خلف)
	
	# مسح المصفوفة
	مجموعة_بسيطة = [] 
	مجموعة_بسيطة.clear()
	مجموعة_بسيطة.resize(0)
	
	print('مجموعة_بسيطة بعد واضح: ', مجموعة_بسيطة)
	
	###
	# مصفوفة مكررة (نسخة عميقة)
	###
	
	# إضافة مجموعة فرعية إلى المصفوفات
	var مجموعة_جديدة = [1,2]
	مجموعة_بسيطة.push_back(مجموعة_جديدة)
	
	# ينسخ
	var نسخة_عميقة = مجموعة_بسيطة.duplicate(true)
	
	# تعديل مجموعة_فرعية
	مجموعة_جديدة.push_back(3)
	
	# التغيير في المصفوفة الفرعية لن يكون له أي تأثير على المصفوفة المكررة
	print('نسخة_عميقة مجموعة_بسيطة: ', نسخة_عميقة) # [[1,2]]
	print('مجموعة_بسيطة: ', مجموعة_بسيطة) # [[1,2,3]]
	
	
	###
	# مصفوفة مكررة (نسخة ضحلة)
	###
	
	# إضافة مجموعة فرعية إلى المصفوفات
	var مجموعة_أخرى = [1,2]
	مجموعة_بسيطة.clear() # مسح المصفوفة، كما هو الحال مع المصفوفات = []
	مجموعة_بسيطة.push_back(مجموعة_أخرى)
	
	# ينسخ
	var نسخة_ضحلة = مجموعة_بسيطة.duplicate(false)
	
	# تعديل مجموعة_فرعية
	مجموعة_أخرى.push_back(3)
	
	# التغيير في المصفوفة الفرعية سيكون له تأثير على المصفوفة المكررة
	print('نسخة_ضحلة مجموعة_بسيطة: ', نسخة_ضحلة) # [[1,2,3]]
	print('مجموعة_بسيطة: ', مجموعة_بسيطة) # [[1,2,3]]
	
	# الحصول على طول المصفوفة
	var حجم_المصفوفة = مجموعة_بسيطة.size()
	print('حجم مجموعة_بسيطة: ', حجم_المصفوفة)
	
	# يمكنك تغيير حجم المصفوفة لتكون أكبر أو أصغر باستخدام resize()
	مجموعة_بسيطة.resize(0) # سوف تقوم بتقصير وحذف العناصر من المصفوفة
	مجموعة_بسيطة.resize(10) # سوف تقوم بتطويل/زيادة طول العنصر بمقدار 10 وإضافة القيمة null
	print('تم تغيير الحجم مجموعة_بسيطة: ', مجموعة_بسيطة)
	
	
