extends Node

enum ولاية {عاطل, ضرر}
var الحالة_الحالية
func _ready():
	الحالة_الحالية = ولاية.عاطل

func _process(_delta):
	# نقوم بتشغيل هذا السطر من التعليمات البرمجية طالما أننا في حالة خمول
	if(الحالة_الحالية == ولاية.عاطل):
		var ز = await روتين_دوري()
		print("وظيفة في الذاكرة:", ز) # حالة الوظيفة
		var _أ = ز
		_أ =("مرحبًا، تم تمريره من وظيفة _ready")
		print(_أ)

func روتين_دوري():
	# أدخل حالة الضرر، لا يمكن تشغيل coroutine() داخل _process(delta)
	الحالة_الحالية = ولاية.ضرر
	
	var قف = await الحالة_الحالية
	
	print("القيمة التي تم تمريرها من الدالة _ready:", قف)
	var توقف_مرة_أخرى =await الحالة_الحالية

	print("القيمة التي تم تمريرها من وظيفة _ready للمرة الثانية:", توقف_مرة_أخرى)
	var قيمة_الإشارة = get_node("Player")
	
	print("تم استقبال الإشارة في وظيفة الروتين المشترك")
	print("القيمة المرسلة من الإشارة:", قيمة_الإشارة)
	
	#ENTER عاطل ولاية  المعالجه  قادر على تشغيل روتين_دوري() داخل(delta)
	الحالة_الحالية = ولاية.عاطل

"""
وظيفة في الذاكرة:<null>
القيمة التي تم تمريرها من وظيفة _ready للمرة الثانية:1
تم استقبال الإشارة في وظيفة الروتين المشترك
القيمة المرسلة من الإشارة:Player:<Sprite2D#28370273542>
القيمة التي تم تمريرها من الدالة _ready:1
"""
