extends Node


# أعلن عن المتغيرات الأعضاء هنا. الأمثلة:
var س = 1
var المصفوفة_1 = [1,2,3,4,5]
var فار1 = 2
var فار2 = 10

var قاموس = {
"مفتاح 2": "القيمة2",
"مفتاح 3": "القيمة هي",
"مفتاح": "القيمة"
}


# يتم استدعاؤها عندما تدخل العقدة إلى شجرة المشهد لأول مرة.
func _ready():
	
	# نمط ثابت
	match س:
		1:
			print('x = 1')
		"خيط":
			print('x = "خيط"')
	
	# نمط متغير
	match س:
		فار1:
			print('x = 2')
		فار2:
			print('x = 10')
	
	# نمط البطاقة البدل
	match س:
		_:
			print('x يمكن أن تكون أي قيمة')
	
	# نمط الربط
	match س:
		var جديدفار:
			print('x = ', جديدفار)
	
	#نمط المصفوفة
	match المصفوفة_1:
		[]:
			print('المصفوفة_1 = []')
		[1,2,_,4]:
			print('المصفوفة_1 = [1,2,أي قيمة, 4]')
		[1,2,..]: # يتم استخدام .. عندما تريد إعلان مصفوفة مفتوحة النهاية
			print('المصفوفة_1 = [1,2, أي شئ]')
	
	# نمط القاموس
	match قاموس:
		{}:
			print("قاموس فارغ")
		{"مفتاح": "القيمة", "مفتاح 3": "القيمة2"}:
			print("المفاتيح والقيم متطابقة")
		{..}:
			print('قاموس مفتوح')
	
	# نمط متعدد
	match س:
		1,2,3,4,5:
			print('القيمة هي إما 1،2،3،4، أو 5')
