extends Node

# إنشاء كائن مثيل
var العدو_الأول = Enemy.new()
var العدو_الثاني = Enemy.new("جين جراي")
#نفس الي فوق
# var loadClass = load("res://BasicClass.gd")
# var newObject = loadClass.new()

func _ready():
	
	# قم بتعديل الكائن الخاص بنا
	# العدو_الأول.اسم = "لا يوجد اسم"
	العدو_الأول.وظيفة_بسيطة() # طباعة العدو
	العدو_الثاني.وظيفة_بسيطة() # طباعة جين جراي
	
	
	
	
	# الإرسال التلقائي إذا قمت عن طريق الخطأ بتمرير نوع بيانات مختلف
	العدو_الأول.اسم = "100" # يتم إرساله كسلسلة
	العدو_الأول.وظيفة_بسيطة() # طباعة "100"
