extends Node


# إنشاء متغير دون تعيين قيمة
var لا_توجد_قيمة_عند_التهيئة

#إنشاء متغير وتعيين قيمة عند التهيئة
var متغير_بقيمة_عند_التهيئة = "Hello Friend!"

#إنشاء متغير بنوع بيانات صريح معين
var القيم_المحددة_فقط: int

#إنشاء متغيرات أثناء الإعلان صراحةً عن نوع البيانات للمتغيرات
# يؤدي هذا إلى إجبار نوع المتغير على البقاء دائمًا كما هو
var فقط_السلاسل: String = "Hi!" # الصب كا سلسلة  
var فقط_عدد_صحيح: int = 5 # صب عدد صحيح
var فقط_العائمة: float = 5.0 # رمي تعويم
var فقط_القيم_المنطقية: bool = true #قم بإلقاء قيمة منطقية

#تحويل نوع البيانات من خلال الاستدلال
#في هذه الحالة، يمكن تعيين السلاسل فقط لهذا المتغير بعد تهيئته
var الاستدلال_على_التهيئة := "Hola!" 

#الصب: إجبار نوع بيانات واحد على نوع آخر
var تغيير_إلى_عدد_صحيح: int = الاستدلال_على_التهيئة as int

# نستخدم هذا داخل الدالة الجاهزة
#إعلان متغير بنوع صريح عقدة ثنائية الأبعاد
var عقدتي_ثنائية_الأبعاد: Node2D

#يتم استدعاؤها عندما تدخل العقدة إلى شجرة المشهد لأول مرة.
func _ready():
	
	# يعمل لأن شبح هو نوع فرعي من عقدة ثنائية الأبعاد
	عقدتي_ثنائية_الأبعاد = $Sprite as Node2D
	
	pass # استبدال بجسم الوظيفة.
