extends Node
class_name Human

#مجموعة تعيين وظيفة, الحصول على وظيفة
#  يمكنك الكتابة على النحو التالي في godot 4.3

var اسم_فريد= "جون":
	get:
		print(' ينشط حاصل')
		return اسم_فريد
	set(قيمة):
		اسم_فريد = قيمة
		print('# ينشط المحدد ', اسم_فريد)

func _ready():
	اسم_فريد = "جين" # لا يتم استدعاء الطريقة
	print(اسم_فريد) #تم تعيين جين , لا يتم استدعاء الطريقة 
	
	self.اسم_فريد = "الشفق القطبي" # لا ينشط المحدد
	self.اسم_فريد # لا ينشط حاصل

func setFunction(المعلمة):
	اسم_فريد = المعلمة
	print('ينشط المحدد ', اسم_فريد)

func getFunction():
	print('ينشط حاصل')
	return اسم_فريد
