extends Node


# الوظيفة الأساسية
func الوظيفة_الأساسية():
	pass # يمكنك أيضًا استخدام "return"، حيث يتم إرجاع القيمة Null بغض النظر عن

# وظيفة أساسية مع المعلمات
func المعلمة_الأساسية(المعلمة):
	# الاسم الموجود في المعلمة هو متغير، فهو يحمل البيانات
	print('المعلمة = ', المعلمة)
	return

# وظيفة أساسية مع نوع بيانات المعلمة
func بيانات_المعلمة(المعلمة: String):
	print('المعلمة = ', المعلمة)

# دالة بقيمة افتراضية في المعلمة
func المعلمة_الافتراضية(المعلمة := 'Hello'): # يتم استنتاج نوع البيانات من خلال القيمة الافتراضية
	print('المعلمة = ', المعلمة)

# نفس الشيء في الأساس مثل الجزء العلوي
func النوع_الإفتراضي(المعلمة: String = 'Hello'):
	print('المعلمة = ', المعلمة)

# تعني الدالة التي تحتوي على null أن الدالة لا ترجع قيمة
func عودة_نوع_الفراغ() :
	return # نوع الإرجاع فارغ

# دالة بنوع إرجاع غير فارغ
func نوع_الإرجاع() -> int:
	return 10 # إرجاع أي شيء بخلاف int سيؤدي إلى حدوث خطأ


# Called when the node enters the scene tree for the first time.
func _ready():
	
	var الشيك_1 = الوظيفة_الأساسية()
	print('\nالوظيفة_الأساسية, يستخدم المرور: ', الشيك_1, '\n')
	
	var الشيك_2 = المعلمة_الأساسية(10)
	print('المعلمة_الأساسية, يستخدم العودة: ', الشيك_2, '\n')
	
	# يجب أن يكون المعامل عبارة عن سلسلة أو يُلقي خطأً
	var الشيك_3 = بيانات_المعلمة('خيط')
	print('بيانات_المعلمة, يستخدم المرور: ', الشيك_3, '\n')
	
	# يجب أن تكون المعلمة عبارة عن سلسلة أو فارغة
	var الشيك_4 = المعلمة_الافتراضية()
	print('المعلمة_الافتراضية, يستخدم المرور: ', الشيك_4, '\n')
	
	# تم إعلان نوع الإرجاع للوظيفة null
	var الشيك_5 = عودة_نوع_الفراغ()
	print('عودة_نوع_الفراغ, يستخدم العودة: ', الشيك_5, '\n')
	
	# تستخدم الدالة نوع الإرجاع int
	var الشيك_6 = نوع_الإرجاع()
	print('نوع_الإرجاع, يستخدم العودة: ', الشيك_6, '\n')
	
	


var صحة_اللاعب = 100
# أمثلة على اتفاقيات التسمية
func الحصول_على_صحة_اللاعب():
	return صحة_اللاعب # يعود 100

func شفاء_اللاعب(نقاط_الصحة:int):
	صحة_اللاعب = صحة_اللاعب + نقاط_الصحة
	# صحة اللاعب += نقاط الصحة

func ضرر_اللاعب(نقاط_الضرر :int):
	صحة_اللاعب = صحة_اللاعب - نقاط_الضرر
	صحة_اللاعب -= نقاط_الضرر
